Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/starting_work_and_changing_job/training_and_looking_for_work/finding_and_getting_a_job.html.txt.tmx
Source language: en
Languages: ga

source: Finding and getting a job
ga: Post a aimsiú agus a fháil

source: When you are looking for a job there is a range of information sources and supports to help you in your search
ga: Nuair atá tú ag cuardach poist, tá raon foinsí eolais agus tacaíochtaí ann chun cabhrú leat

source: You may looking for a job for the first time after leaving school or college or you may be thinking of changing job or returning to work
ga: D'fhéadfá a bheith ag cuardach poist don chéad uair tar éis an scoil nó coláiste a fhágáil nó d'fhéadfá a bheith ag smaoineamh faoi phost a athrú nó filleadh chun na hoibre

source: If you are unemployed, there are a number of services and supports to help you find work – see below
ga: Má tá tú dífhostaithe, tá roinnt seirbhísí agus tacaíochtaí ar fáil chun cabhrú leat obair a aimsiú - féach thíos

source: Whether you are currently in work, unemployed or in education, the process of finding and applying for a job is the same
ga: Bíonn an próiseas aimsithe agus iarratais poist mar an gcéanna, cibé an bhfuil tú ag obair i láthair na huaire, dífhostaithe nó i mbun oideachais

source: It is important to research all possible sources of information on employment opportunities, to send in a well-prepared job application with a relevant CV (curriculum vitae) and, if your application is not successful, to continue the search for employment
ga: Tá sé tábhachtach taighde a dhéanamh ar na foinsí eolais ar fad atá ar fáil duit maidir le deiseanna oibre, iarratas poist atá dea-ullmhaithe le CV (curriculum vitae) ábhartha a sheoladh agus, mura bhfuil rath ar d'iarratas, leanúint ag cuardach fostaíochta

source: Alternatively you should also look at other options such as returning to education or self-employment
ga: Rogha eile ná breathnú ar roghanna eile cosúil le filleadh ar oideachas nó féinfhostaíocht

source: If you are coming from outside Ireland to work you can find more information in our document, Finding a job in Ireland
ga: Má thagann tú ó áit lasmuigh d'Éirinn, is féidir leat breis eolais a fháil inár ndoiciméad, Post a aimsiú in Éirinn

source: To begin your job search you need to identify the different places where jobs are advertised
ga: Chun tús a chur le do chuardach poist, caithfidh tú áiteanna difriúla ina bhfógraítear poist a aithint

source: You should check all the sources listed below regularly to ensure you are aware of any new vacancies
ga: Ba chóir duit na foinsí ar fad atá liostaithe thíos a sheiceáil go rialta le cinntiú go bhfuil tú feasach ar fholúntais nua ar bith

source: The main ones are:
ga: Is iad na cinn is tábhachtaí ná:

source: • Your local Intreo centre/employment services office – see ‘Where to apply’ below – provides information and advice for jobseekers including a list of job vacancies and a Jobseeker Information Pack (pdf)
ga: • Ionad Intreo/oifig seirbhísí fostaíochta áitiúil - féach 'Cá háit a ndéanfaidh mé iarratas' thíos. Soláthraíonn siad faisnéis agus comhairle do chuardaitheoirí poist chomh maith le liosta na bhfolúntas agus Pacáiste Faisnéise do Chuardaitheoir Phoist (pdf)

source: Intreo is a new service from the Department of Social Protection which provides a single point of contact for all employment and income supports
ga: Seirbhís nua ón Roinn Coimirce Sóisialaí is ea Intreo a soláthróidh pointe teagmhála aonair le haghaidh iomlán tacaíochtaí fostaíochta ioncaim

source: You can read more in our document about employment services for jobseekers
ga: Foilseoidh sonraí de na láithreacha nua ar welfare.ie agus beidh Intreo ar fáil sna hoifigí go léir faoin mbliain 2014

source: • Websites: The Jobs Ireland website lists jobs available in Ireland and abroad. It also lists internships and employment programme vacancies
ga: • Láithreáin Ghréasáin: Ceadaíonn láithreán gréasáin Jobs Ireland duit do CV a uaslódáil áit gur féidir le fostóirí é a fheiceáil

source: Employers can access these CVs through this database and contact a jobseeker directly
ga: Má dhéanann tú cuardach ar líne, aimseoidh tú raon láithreán gréasáin eile faoi phoist

source: • Newspapers: Classified jobs sections of national and local newspapers
ga: • Nuachtáin: Rannóga aicmithe poist sna nuachtáin náisiúnta agus áitiúla

source: • Recruitment agencies: You will find them listed in the telephone directory or by doing an online search
ga: • Gníomhaireachtaí earcaíochta: Gheobhaidh tú iad san eolaí teileafóin nó trí chuardach ar líne a dhéanamh

source: There are specialist recruitment agencies if you are looking for a particular type of job
ga: Tá gníomhaireachtaí earcaíochta speisialta ann má tá cineál áirithe poist á lorg agat

source: • Notices: Jobs are often advertised in shop and restaurant windows, in libraries, supermarkets and other community noticeboards
ga: • Fógraí: Is minic a bhíonn poist fógraithe ar an bhfuinneog i siopaí agus bialanna, i leabharlanna, sna hollmhargaí agus ar chláir fógraí pobail eile

source: • Companies: As vacancies are often only advertised on a company website, you should check those which are relevant to your area of work
ga: • Comhlachtaí: Is minic go mbíonn folúntais fógraithe ar láithreán gréasáin an chomhlachta amháin - ba chóir duit na láithreáin ghréasáin atá ábhartha don réimse oibre a bhaineann leat a sheiceáil

source: • Personal contacts: Friends or relatives may know of job opportunities
ga: • Teagmhálacha pearsanta: D'fheadfadh fios a bheith ag cairde nó gaolta faoi dheiseanna oibre

source: The Citizens Information website does not carry any information about job vacancies for any sector of the Irish economy
ga: Níl aon eolas ar láithreán gréasáin Faisnéis do Shaoránaigh faoi fholúntais poist maidir le hearnáil ar bith d'eacnamaíocht na hÉireann

source: It does not accept CVs/resumés and cannot forward them to employers on your behalf
ga: Ní ghlacann siad le CV/resumé agus ní féidir leo iad a sheoladh ar aghaidh chuig fostóirí ar do shon féin

source: Your CV or resumé is a very important document
ga: Is doiciméad fíorthábhachtach é do CV nó resumé

source: It is a summary of your personal details, educational qualifications and work experience
ga: Is achoimre iad ar do shonraí pearsanta, cáilíochtaí oideachais agus taithí oibre

source: It should also include your key skills and other relevant information together with the names of 2 people who will provide a reference for you
ga: Ba chóir go mbeadh do phríomhscileanna agus eolas ábhartha eile ann chomh maith, mar aon le hainmneacha beirt a sholáthróidh teistiméireacht duit

source: When you identify a job vacancy, contact the employer to get further details about it and the company
ga: Nuair a thagann tú ar fholúntas, déan teagmháil leis an bhfostóir chun breis sonraí a fháil faoi agus faoin gcomhlacht féin

source: You should update your CV and send it with a letter or application form as specified in the job advertisement
ga: Ba chóir duit do CV a nuashonrú agus a sheoladh ar aghaidh le litir nó foirm iarratais mar atá sonraithe san fhógra poist

source: The information in your CV and application letter or form should focus on the specific requirements of the job
ga: Ba chóir don eolas sa CV agus sa litir nó san fhoirm iarratais díriú ar riachtanais shonracha an phoist

source: If you are called for a job interview it is important to prepare for it
ga: Tá sé tábhachtach ullmhú má fhaigheann tú glaoch chun agallaimh le haghaidh poist

source: If you are unemployed, your local employment service (LES) or Job Club can assist you with writing CVs and job applications and with training in interview skills – see ‘Other supports’ below
ga: Má tá tú dífhostaithe, is féidir le do sheirbhís fostaíochta áitiúil (LES) nó Club Poist cabhrú leat chun CV agus iarratais poist a scríobh agus le hoiliúint i scileanna agallaimh - féach 'Tacaíochtaí eile' thíos

source: Employment equality: You are protected by employment equality legislation when you are applying for a job as well as when you are in employment
ga: Comhionannas fostaíochta: Tá cosaint agat ó reachtaíocht comhionannais fostaíochta nuair atá tú ag déanamh iarratais ar phost, chomh maith leis an tréimhse a mbíonn tú i mbun fostaíochta

source: So if you are applying for a job it is unlawful for your prospective employer to discriminate against you on any of the 9 grounds such as race or family status
ga: Mar sin má tá tú ag déanamh iarratais ar phost, tá sé neamhdhleathach don fhostóir ionchasach leatrom a dhéanamh ort ar cheann ar bith den 9 fhoras cosúil le cine, inscne nó stádas teaghlaigh

source: There is more information about this in our document about the Irish Human Rights and Equality Commission
ga: Tá tuilleadh eolais faoi na cúrsaí seo inár ndoiciméad faoin Choimisiún na hÉireann um Chearta an Duine agus Comhionannas

source: Long-term unemployed people: There is a range of employment support schemes which encourage long-term unemployed people to return to work
ga: Daoine atá dífhostaithe go fadtéarmach: Tá raon scéimeanna tacaíochta fostaíochta a spreagann daoine atá dífhostaithe go fadtéarmach filleadh chun na hoibre

source: They are aimed at people who have been on unemployment or certain other social welfare payments for a specific period of time
ga: Tá siad dírithe ar dhaoine atá ag fáil sochair dífhostaíochta nó íocaíochtaí leasa shóisialaigh áirithe eile ar feadh saintréimhse ama

source: Some schemes, such as Community Employment provide community-based employment opportunities
ga: Tá scéimeanna áirithe ann, cosúil le Fostaíocht Pobail a sholáthraíonn deiseanna fostaíochta atá pobalbhunaithe

source: Other schemes such as the Back to Work Enterprise Allowance allow people on certain social welfare payments to take up self-employment while retaining some of their payment
ga: Ceadaíonn scéimeanna eile cosúil leis an Liúntas Fiontraíochta um Fhilleadh ar Obair do dhaoine ar íocaíochtaí leasa shóisialaigh áirithe obair a ghlacadh agus cuid den íocaíocht a choinneáil

source: JobBridge internships provide work experience opportunities
ga: Soláthraíonn intéirneachtaí JobBridge deiseanna taithí oibre

source: Local employment services – Obair (LES) were set up to help long-term unemployed people find work. They operate generally through partnership companies and provide mediators who help with the job search and liaise with local employers
ga: Soláthraíonn clubanna poist oiliúint agus tacaíocht do chuardaitheoirí poist trí chabhrú leo CV a ullmhú, oiliúint a fháil i scileanna agallaimh agus post a chuardach

source: Job Clubs provide training and support for jobseekers by assisting with preparing CVs, training in interview skills and with the search for a job
ga: Bunaíodh seirbhísí fostaíochta áitiúla – Obair (LES) chun cabhrú le daoine atá dífhostaithe go fadtéarmach obair a aimsiú

source: They also provide ‘drop in’ services and formal workshops lasting from 1 to 4 weeks. To attend a formal workshop you must be a jobseeker who has been referred by an employment services office or a local employment service
ga: Feidhmíonn siad trí chomhlachtaí comhpháirtíochta go ginearálta agus soláthraíonn siad idirghabhálaithe a chabhraíonn leis an gcuardach poist agus a dhéanann teagmháil le fostóirí áitiúla

source: You may get €20 per week to help with any additional costs you incur while attending the formal workshops
ga: Soláthraíonn LES comhairleoireacht threorach chomh maith chun breathnú ar roghanna oiliúna agus scéimeanna fostaíochta

source: A Training Support Grant (TSG) is available to jobseekers and people getting certain other payments
ga: Tá Deontas um Oiliúint a Thacú (DOT) ar fáil do chuardaitheoirí poist agus do dhaoine a fhaigheann íocaíochtaí eile áirithe

source: The TSG provides quick access to short-term training that is not immediately available from a State provider or that will help you get a job quickly
ga: Soláthraíonn an DOT rochtain thapa ar oiliúint ghearrthéarmach nach bhfuil ar fáil láithreach ó soláthróir Stáit nó a chabhraíonn leat post a fháil go tapa

source: Your case officer can approve a grant under this scheme if it meets your identified needs (for example, as set out in your Personal Progression Plan) and is not available from another State provider
ga: Má tá sé oiriúnach le do riachtanais (mar a leagtha síos i do Phlean Dul Chun Cinn Pearsanta) agus mura bhfuil sé ar fáil ó soláthróir Stáit eile, is féidir le d’oifigeach cáis deontas faoin scéim a cheadú

source: For more information on finding and getting a job you can download Working for Work and a leaflet on looking for work (pdf) from the website of the Irish National Organisation of the Unemployed
ga: Chun tuilleadh faisnéise a fháil faoi phost a aimsiú agus a fháil, is féidir leat Working for Work agus bileog maidir le post a chuardaigh (pdf) a íoslódáil ó láithreán gréasáin Eagraíocht na hÉireann do Dhaoine Dífhostaithe

source: Contact your local Intreo centre or local employment services office
ga: Déan teagmháil leis an oifig seirbhísí fostaíochta áitiúil
